# Project 4 Task 2
Author: [Julia Fangman](https://github.com/juliafangman)
Repository: [datafun-04-notebooks](https://github.com/juliafangman/datafun-04-notebooks)

## Task 1. Create DataFrame

In [2]:
import pandas as pd
grades_dict = {'Wally': [87, 96,70], 'Eva': [100, 87, 90], 'Sam': [94, 77, 90], 'Katie': [100, 81, 82], 'Bob': [83, 65, 85]}
grades = pd.DataFrame(grades_dict)
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

## Task 2. Custom Index

In [8]:
pd.DataFrame(grades_dict, index=['Test1', 'Test2', 'Test3'])
grades.index = ['Test1', 'Test2', 'Test3']
grades['Eva']
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

## Task 3a. Accessing Rows (loc, iloc)

In [9]:
grades.loc['Test1']
grades.iloc[0:2]
#I think I prefer loc since it allows you to search for specific names

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65

## Task 3b. Accessing Subsets (at, iat)

In [10]:
grades.at['Test2', 'Eva']
grades.iat[2,0]

70

## Task 4. Describe (By Column)

In [12]:
grades.describe()
pd.set_option("display.precision",2)
#pd.set_option('precision',2) didn't work, and upon initial search I could only find this resource for troubleshooting: https://pandas.pydata.org/docs/user_guide/options.html

## Task 5. Transpose (rows<-->columns)

In [13]:
grades.mean()
grades.T
grades.T.describe()

        Test1  Test2  Test3
count    5.00   5.00   5.00
mean    92.80  81.20  83.40
std      7.66  11.54   8.23
min     83.00  65.00  70.00
25%     87.00  77.00  82.00
50%     94.00  81.00  85.00
75%    100.00  87.00  90.00
max    100.00  96.00  90.00

## Task 6. Sort

In [14]:
grades.sort_index(ascending=False)
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  Wally
Test1   83  100    100   94     87
Test2   65   87     81   77     96
Test3   85   90     82   90     70


```shell
jupyter nbconvert --execute juliafangman_2.ipynb
```